---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.ConnectionGuid
source: html/625f6a3a-b0af-0d21-1f20-0af3609049bd.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.ConnectionGuid Property

The GUID to use for identifying connection geometry generation algorithm.

## Syntax (C#)
```csharp
public Guid ConnectionGuid { get; }
```